# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "nikitabobko/tap"         # For AeroSpace window manager

# ------------------------------------------------------------------------------
# Essential Tools
# ------------------------------------------------------------------------------
brew "git"
brew "stow"              # Dotfiles management
brew "zsh"               # Latest ZSH
brew "neovim"            # Modern text editor
brew "ripgrep"           # Fast grep (rg) - used in prompt and fzf
brew "fzf"               # Fuzzy finder
brew "bat"               # Better cat with syntax highlighting
brew "eza"               # Better ls with colors and icons
brew "fd"                # Better find
brew "zoxide"            # Smart cd replacement
brew "tree"              # Directory tree view
brew "jq"                # JSON processor
brew "starship"          # Fast, customizable prompt
brew "tmux"              # Terminal multiplexer
brew "just"              # Command runner
brew "lazygit"           # Terminal UI for git
brew "yazi"              # Terminal file manager

# ------------------------------------------------------------------------------
# Development Languages & Tools
# ------------------------------------------------------------------------------
brew "rustup-init"       # Rust toolchain installer
brew "go"                # Go programming language
brew "coreutils"         # GNU core utilities
brew "moreutils"         # Additional utilities
brew "findutils"         # GNU find, xargs, locate
brew "gnu-sed"           # GNU sed
brew "grep"              # GNU grep
brew "harper"            # Local grammar checker
brew "shellcheck"        # Shell script analyzer
brew "markdownlint-cli2" # Markdown linting
brew "uv"                # Fast Python package installer


# ------------------------------------------------------------------------------
# Cloud & DevOps
# ------------------------------------------------------------------------------
brew "awscli"            # AWS CLI (for aws context detection)
brew "opentofu"          # OpenTofu (Terraform alternative)
brew "docker"            # Docker CLI
brew "ansible"           # Configuration management
brew "tailscale"         # VPN mesh network

# ------------------------------------------------------------------------------
# Security & Authentication
# ------------------------------------------------------------------------------
cask "1password"         # Password manager
cask "1password-cli"     # 1Password CLI
brew "openssh"           # OpenSSH client
brew "libfido2"          # FIDO2 library for security keys
brew "ykman"             # YubiKey Manager
brew "age"               # File encryption tool
brew "sops"              # Secrets management

# ------------------------------------------------------------------------------
# Media & Download Tools
# ------------------------------------------------------------------------------
brew "yt-dlp"            # Video downloader
brew "gallery-dl"        # Gallery downloader
brew "ffmpeg"            # Media processing
brew "aria2"             # Download manager

# ------------------------------------------------------------------------------
# System & Network Utilities
# ------------------------------------------------------------------------------
brew "ncdu"              # Disk usage analyzer
brew "wget"              # Download utility
brew "tlrc"              # Fast TL;DR client in Rust
brew "mas"               # Mac App Store CLI
brew "terminal-notifier" # Notifications from terminal
brew "wifi-password"     # WiFi password retrieval
brew "trash-cli"         # Safe trash management (provides trash-empty, trash-list)
brew "dockutil"          # Manage Dock items from CLI
brew "prettyping"        # Better ping
brew "diff-so-fancy"     # Better git diff
brew "fastfetch"         # Fast system info (neofetch replacement)
brew "btop"              # Btop (top replacement)
brew "telnet"            # Telnet client
brew "hugo"              # Static site generator

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
cask "font-iosevka-term-nerd-font"  # IosevkaTerm NFM for terminal

# ------------------------------------------------------------------------------
# Applications
# ------------------------------------------------------------------------------

# Terminal & Development
cask "ghostty@tip"       # Nightly with auto-updates
cask "visual-studio-code" # Code editor
cask "sublime-text"      # Text editor
cask "claude"            # Claude desktop app
cask "claude-code"       # Claude Code CLI

# System Utilities
cask "pearcleaner"       # App remover
cask "raycast"           # Launcher and productivity
cask "transmit"          # File transfer client
cask "logi-options+"     # Logitech device manager
cask "carbon-copy-cloner" # Backup software
cask "dropbox"           # Cloud storage

# Media
cask "vlc"               # Media player

# Browsers
cask "google-chrome"     # Chrome browser
cask "firefox"           # Firefox browser

# Communication & Productivity
cask "slack"             # Team communication
cask "discord"           # Communication platform
cask "spotify"           # Music streaming

# Security
cask "little-snitch"     # Network monitor
cask "micro-snitch"      # Microphone/camera monitor

# Window Management
cask "nikitabobko/tap/aerospace"  # Tiling window manager

# PKM & Notes
cask "obsidian"

# Creative & Design
cask "ogdesign-eagle"    # Digital asset organizer
cask "macwhisper"        # AI transcription

# Gaming
cask "steam"
