# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "nikitabobko/tap"         # For AeroSpace window manager

# ------------------------------------------------------------------------------
# Essential Tools
# ------------------------------------------------------------------------------
brew "git"
brew "stow"              # Dotfiles management
brew "zsh"               # Latest ZSH
brew "neovim"            # Modern text editor
brew "ripgrep"           # Fast grep (rg) - used in prompt and fzf
brew "fzf"               # Fuzzy finder
brew "bat"               # Better cat with syntax highlighting
brew "eza"               # Better ls with colors and icons
brew "fd"                # Better find
brew "zoxide"            # Smart cd replacement
brew "tree"              # Directory tree view
brew "jq"                # JSON processor
brew "starship"          # Fast, customizable prompt
brew "tmux"              # Terminal multiplexer
brew "just"              # Command runner
brew "lazygit"           # Terminal UI for git

# ------------------------------------------------------------------------------
# Development Languages & Tools
# ------------------------------------------------------------------------------
brew "coreutils"         # GNU core utilities
brew "moreutils"         # Additional utilities
brew "findutils"         # GNU find, xargs, locate
brew "gnu-sed"           # GNU sed
brew "grep"              # GNU grep
brew "shellcheck"        # Shell script analyzer
brew "shfmt"             # Shell formatter
brew "markdownlint-cli2" # Markdown linting
brew "gitleaks"          # Secret scanning


# ------------------------------------------------------------------------------
# Cloud & DevOps
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# Security & Authentication
# ------------------------------------------------------------------------------
cask "1password"         # Password manager
cask "1password-cli"     # 1Password CLI
brew "openssh"           # OpenSSH client
brew "libfido2"          # FIDO2 library for security keys
brew "ykman"             # YubiKey Manager
brew "age"               # File encryption tool
brew "sops"              # Secrets management

# ------------------------------------------------------------------------------
# Media & Download Tools
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# System & Network Utilities
# ------------------------------------------------------------------------------
brew "ncdu"              # Disk usage analyzer
brew "wget"              # Download utility
brew "tlrc"              # Fast TL;DR client in Rust
brew "mas"               # Mac App Store CLI
brew "trash-cli"         # Safe trash management (provides trash-empty, trash-list)
brew "dockutil"          # Manage Dock items from CLI
brew "prettyping"        # Better ping
brew "diff-so-fancy"     # Better git diff
brew "fastfetch"         # Fast system info (neofetch replacement)
brew "btop"              # Btop (top replacement)
brew "telnet"            # Telnet client

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
cask "font-iosevka-term-nerd-font"  # IosevkaTerm NFM for terminal

# ------------------------------------------------------------------------------
# Applications
# ------------------------------------------------------------------------------

# Terminal & Development
cask "ghostty@tip"       # Nightly with auto-updates
cask "visual-studio-code" # Code editor
cask "sublime-text"      # Text editor

# System Utilities
cask "pearcleaner"       # App remover
cask "raycast"           # Launcher and productivity
cask "cleanshot"         # Screenshot and screen recording
cask "logi-options+"     # Logitech device manager

# Browsers
cask "google-chrome"     # Chrome browser
cask "firefox"           # Firefox browser

# Communication & Productivity
cask "spotify"           # Music streaming

# Security
cask "little-snitch"     # Network monitor
cask "micro-snitch"      # Microphone/camera monitor

# Window Management
cask "nikitabobko/tap/aerospace"  # Tiling window manager

# PKM & Notes
cask "obsidian"

# Creative & Design
